// Задание 1
//Создайте переменную a. Запишите в нее значение 10, выведите его на экран с помощью метода alert(). Затем запишите в нее же значение 20, выведите его на экран.

let a = 10;
alert (a);
a = 20;
alert (a);

// Задание 2 
//Создайте переменную и присвойте ей значение года выпуска первого iPhone. Выведите значение переменной на экран.

const iphoneYear = 2007;
alert (iphoneYear);

// Задание 3 
//Создайте переменную и присвойте ей значение имени создателя языка JavaScript. Выведите значение переменной на экран.

const jsCreator = 'Брендан Эйх';
console.log (jsCreator);

// Задание 4 
//Создайте две переменные: 10 и 2. С помощью метода alert() выведите на экран их сумму, разность, произведение и частное (результат деления).

let b = 10;
let c = 2;
 alert (b + c);
 alert (b - c);
 alert (b * c);
 alert (b / c);


//  Задание 5
//Возведите 2 в 5-ю степень. Результат запишите в переменную result и выведите на экран с помощью метода alert()

let d = 2;
let power = 2 ** 5;
alert (power);


// Задание 6
//Даны переменные: a = 9 и b = 2. Найдите остаток от деления a на b и выведите результат на экран с помощью метода alert()

let x = 9;
let y = 2;
let remainder = x % y;
alert (remainder);


// Задание 7
//Перепишите код с использованием операторов присваивания и инкремента/декремента (количество строк должно остаться прежним):

let num = 1;
num += 5;
num -= 3;
num *= 7;
num /= 3;
num += 1;
num -= 1;
alert(num);


// Задание 8
// Создайте переменную age, присвойте ей значение с помощью метода prompt() «Сколько вам лет?». Результат выведите с помощью alert()

let age = prompt ('Сколько вам лет?');
alert (age);


// Задание 9
// Создайте объект user, у которого есть следующие свойства: 
// name, age, isAdmin. Значения для свойств придумайте произвольные. Обратите внимание, что для свойства name значение должно быть строковым, для age — числовым, а для isAdmin — булевым.

// const user = {
//     name: 'Bob',
//     age: 22,
//     isAdmin: true,
// }



//  Задание 10
// С помощью метода prompt() спросите у пользователя его имя и сохраните в переменную. С помощью метода alert() выведите на экран шаблонную строку: Привет, ИМЯ!

let userName;
userName = prompt ('Как Вас зовут?');
alert (`Привет, ${userName}!`)

